var phoneCodes = [{
    "mask": "+247-####",
    "cc"  : "AC",
    "name": "Остров Вознесения"
}, {
    "mask": "+376-###-###",
    "cc"  : "AD",
    "name": "Андорра"
}, {
    "mask": "+971-5#-###-####",
    "cc"  : "AE",
    "name": "Объединенные Арабские Эмираты"
}, {
    "mask": "+971-#-###-####",
    "cc"  : "AE",
    "name": "Объединенные Арабские Эмираты"
}, {
    "mask": "+93-##-###-####",
    "cc"  : "AF",
    "name": "Афганистан"
}, {
    "mask": "+1 (268) ###-####",
    "cc"  : "AG",
    "name": "Антигуа и Барбуда"
}, {
    "mask": "+1 (264) ###-####",
    "cc"  : "AI",
    "name": "Ангилья"
}, {
    "mask": "+355 (###) ###-###",
    "cc"  : "AL",
    "name": "Албания"
}, {
    "mask": "+374-##-###-###",
    "cc"  : "AM",
    "name": "Армения"
}, {
    "mask": "+599-###-####",
    "cc"  : "AN",
    "name": "Карибские Нидерланды"
}, {
    "mask": "+599-###-####",
    "cc"  : "AN",
    "name": "Нидерландские Антильские острова"
}, {
    "mask": "+599-9###-####",
    "cc"  : "AN",
    "name": "Нидерландские Антильские острова"
}, {
    "mask": "+244 (###) ###-###",
    "cc"  : "AO",
    "name": "Ангола"
}, {
    "mask": "+672-1##-###",
    "cc"  : "AQ",
    "name": "Австралийская антарктическая база"
}, {
    "mask": "+54 (###) ###-####",
    "cc"  : "AR",
    "name": "Аргентина"
}, {
    "mask": "+1 (684) ###-####",
    "cc"  : "AS",
    "name": "Американское Самоа"
}, {
    "mask": "+43 (###) ###-####",
    "cc"  : "AT",
    "name": "Австрия"
}, {
    "mask": "+61-#-####-####",
    "cc"  : "AU",
    "name": "Австралия"
}, {
    "mask": "+297-###-####",
    "cc"  : "AW",
    "name": "Аруба"
}, {
    "mask": "+994-##-###-##-##",
    "cc"  : "AZ",
    "name": "Азербайджан"
}, {
    "mask": "+387-##-#####",
    "cc"  : "BA",
    "name": "Босния и Герцеговина"
}, {
    "mask": "+387-##-####",
    "cc"  : "BA",
    "name": "Босния и Герцеговина"
}, {
    "mask": "+1 (246) ###-####",
    "cc"  : "BB",
    "name": "Барбадос"
}, {
    "mask": "+880-##-###-###",
    "cc"  : "BD",
    "name": "Бангладеш"
}, {
    "mask": "+32 (###) ###-###",
    "cc"  : "BE",
    "name": "Бельгия"
}, {
    "mask": "+226-##-##-####",
    "cc"  : "BF",
    "name": "Буркина Фасо"
}, {
    "mask": "+359 (###) ###-###",
    "cc"  : "BG",
    "name": "Болгария"
}, {
    "mask": "+973-####-####",
    "cc"  : "BH",
    "name": "Бахрейн"
}, {
    "mask": "+257-##-##-####",
    "cc"  : "BI",
    "name": "Бурунди"
}, {
    "mask": "+229-##-##-####",
    "cc"  : "BJ",
    "name": "Бенин"
}, {
    "mask": "+1 (441) ###-####",
    "cc"  : "BM",
    "name": "Бермудские острова"
}, {
    "mask": "+673-###-####",
    "cc"  : "BN",
    "name": "Бруней-Даруссалам"
}, {
    "mask": "+591-#-###-####",
    "cc"  : "BO",
    "name": "Боливия"
}, {
    "mask": "+55 (##) ####-####",
    "cc"  : "BR",
    "name": "Бразилия"
}, {
    "mask": "+55 (##) 7###-####",
    "cc"  : "BR",
    "name": "Бразилия"
}, {
    "mask": "+55 (##) 9####-####",
    "cc"  : "BR",
    "name": "Бразилия"
}, {
    "mask": "+1 (242) ###-####",
    "cc"  : "BS",
    "name": "Багамские Острова"
}, {
    "mask": "+975-17-###-###",
    "cc"  : "BT",
    "name": "Бутан"
}, {
    "mask": "+975-#-###-###",
    "cc"  : "BT",
    "name": "Бутан"
}, {
    "mask": "+267-##-###-###",
    "cc"  : "BW",
    "name": "Ботсвана"
}, {
    "mask": "+375 (##) ###-##-##",
    "cc"  : "BY",
    "name": "Беларусь (Белоруссия)"
}, {
    "mask": "+501-###-####",
    "cc"  : "BZ",
    "name": "Белиз"
}, {
    "mask": "+243 (###) ###-###",
    "cc"  : "CD",
    "name": "Дем. Респ. Конго (Киншаса)"
}, {
    "mask": "+236-##-##-####",
    "cc"  : "CF",
    "name": "Центральноафриканская Республика"
}, {
    "mask": "+242-##-###-####",
    "cc"  : "CG",
    "name": "Конго (Браззавиль)"
}, {
    "mask": "+41-##-###-####",
    "cc"  : "CH",
    "name": "Швейцария"
}, {
    "mask": "+225-##-###-###",
    "cc"  : "CI",
    "name": "Кот-д’Ивуар"
}, {
    "mask": "+682-##-###",
    "cc"  : "CK",
    "name": "Острова Кука"
}, {
    "mask": "+56-#-####-####",
    "cc"  : "CL",
    "name": "Чили"
}, {
    "mask": "+237-####-####",
    "cc"  : "CM",
    "name": "Камерун"
}, {
    "mask": "+86 (###) ####-####",
    "cc"  : "CN",
    "name": "Китайская Н.Р."
}, {
    "mask": "+86 (###) ####-###",
    "cc"  : "CN",
    "name": "Китайская Н.Р."
}, {
    "mask": "+86-##-#####-#####",
    "cc"  : "CN",
    "name": "Китайская Н.Р."
}, {
    "mask": "+57 (###) ###-####",
    "cc"  : "CO",
    "name": "Колумбия"
}, {
    "mask": "+506-####-####",
    "cc"  : "CR",
    "name": "Коста-Рика"
}, {
    "mask": "+53-#-###-####",
    "cc"  : "CU",
    "name": "Куба"
}, {
    "mask": "+238 (###) ##-##",
    "cc"  : "CV",
    "name": "Кабо-Верде"
}, {
    "mask": "+599-###-####",
    "cc"  : "CW",
    "name": "Кюрасао"
}, {
    "mask": "+357-##-###-###",
    "cc"  : "CY",
    "name": "Кипр"
}, {
    "mask": "+420 (###) ###-###",
    "cc"  : "CZ",
    "name": "Чехия"
}, {
    "mask": "+49 (####) ###-####",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+49 (###) ###-####",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+49 (###) ##-####",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+49 (###) ##-###",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+49 (###) ##-##",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+49-###-###",
    "cc"  : "DE",
    "name": "Германия"
}, {
    "mask": "+253-##-##-##-##",
    "cc"  : "DJ",
    "name": "Джибути"
}, {
    "mask": "+45-##-##-##-##",
    "cc"  : "DK",
    "name": "Дания"
}, {
    "mask": "+1 (767) ###-####",
    "cc"  : "DM",
    "name": "Доминика"
}, {
    "mask": "+1 (809) ###-####",
    "cc"  : "DO",
    "name": "Доминиканская Республика"
}, {
    "mask": "+1 (829) ###-####",
    "cc"  : "DO",
    "name": "Доминиканская Республика"
}, {
    "mask": "+1 (849) ###-####",
    "cc"  : "DO",
    "name": "Доминиканская Республика"
}, {
    "mask": "+213-##-###-####",
    "cc"  : "DZ",
    "name": "Алжир"
}, {
    "mask": "+593-##-###-####",
    "cc"  : "EC",
    "name": "Эквадор"
}, {
    "mask": "+593-#-###-####",
    "cc"  : "EC",
    "name": "Эквадор"
}, {
    "mask": "+372-####-####",
    "cc"  : "EE",
    "name": "Эстония"
}, {
    "mask": "+372-###-####",
    "cc"  : "EE",
    "name": "Эстония"
}, {
    "mask": "+20 (###) ###-####",
    "cc"  : "EG",
    "name": "Египет"
}, {
    "mask": "+291-#-###-###",
    "cc"  : "ER",
    "name": "Эритрея"
}, {
    "mask": "+34 (###) ###-###",
    "cc"  : "ES",
    "name": "Испания"
}, {
    "mask": "+251-##-###-####",
    "cc"  : "ET",
    "name": "Эфиопия"
}, {
    "mask": "+358 (###) ###-##-##",
    "cc"  : "FI",
    "name": "Финляндия"
}, {
    "mask": "+679-##-#####",
    "cc"  : "FJ",
    "name": "Фиджи"
}, {
    "mask": "+500-#####",
    "cc"  : "FK",
    "name": "Фолклендские острова"
}, {
    "mask": "+691-###-####",
    "cc"  : "FM",
    "name": "Ф.Ш. Микронезии"
}, {
    "mask": "+298-###-###",
    "cc"  : "FO",
    "name": "Фарерские острова"
}, {
    "mask": "+262-#####-####",
    "cc"  : "FR",
    "name": "Майотта"
}, {
    "mask": "+33 (###) ###-###",
    "cc"  : "FR",
    "name": "Франция"
}, {
    "mask": "+508-##-####",
    "cc"  : "FR",
    "name": "Сен-Пьер и Микелон"
}, {
    "mask": "+590 (###) ###-###",
    "cc"  : "FR",
    "name": "Гваделупа"
}, {
    "mask": "+241-#-##-##-##",
    "cc"  : "GA",
    "name": "Габон"
}, {
    "mask": "+1 (473) ###-####",
    "cc"  : "GD",
    "name": "Гренада"
}, {
    "mask": "+995 (###) ###-###",
    "cc"  : "GE",
    "name": "Грузия"
}, {
    "mask": "+594-#####-####",
    "cc"  : "GF",
    "name": "Фр. Гвиана"
}, {
    "mask": "+233 (###) ###-###",
    "cc"  : "GH",
    "name": "Гана"
}, {
    "mask": "+350-###-#####",
    "cc"  : "GI",
    "name": "Гибралтар"
}, {
    "mask": "+299-##-##-##",
    "cc"  : "GL",
    "name": "Гренландия"
}, {
    "mask": "+220 (###) ##-##",
    "cc"  : "GM",
    "name": "Гамбия"
}, {
    "mask": "+224-##-###-###",
    "cc"  : "GN",
    "name": "Гвинея"
}, {
    "mask": "+240-##-###-####",
    "cc"  : "GQ",
    "name": "Экваториальная Гвинея"
}, {
    "mask": "+30 (###) ###-####",
    "cc"  : "GR",
    "name": "Греция"
}, {
    "mask": "+502-#-###-####",
    "cc"  : "GT",
    "name": "Гватемала"
}, {
    "mask": "+1 (671) ###-####",
    "cc"  : "GU",
    "name": "Гуам"
}, {
    "mask": "+245-#-######",
    "cc"  : "GW",
    "name": "Гвинея-Бисау"
}, {
    "mask": "+592-###-####",
    "cc"  : "GY",
    "name": "Гайана"
}, {
    "mask": "+852-####-####",
    "cc"  : "HK",
    "name": "Гонконг"
}, {
    "mask": "+504-####-####",
    "cc"  : "HN",
    "name": "Гондурас"
}, {
    "mask": "+385-##-###-###",
    "cc"  : "HR",
    "name": "Хорватия"
}, {
    "mask": "+509-##-##-####",
    "cc"  : "HT",
    "name": "Гаити"
}, {
    "mask": "+36 (###) ###-###",
    "cc"  : "HU",
    "name": "Венгрия"
}, {
    "mask": "+62 (8##) ###-####",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+62-##-###-##",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+62-##-###-###",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+62-##-###-####",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+62 (8##) ###-###",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+62 (8##) ###-##-###",
    "cc"  : "ID",
    "name": "Индонезия"
}, {
    "mask": "+353 (###) ###-###",
    "cc"  : "IE",
    "name": "Ирландия"
}, {
    "mask": "+972-5#-###-####",
    "cc"  : "IL",
    "name": "Израиль"
}, {
    "mask": "+972-#-###-####",
    "cc"  : "IL",
    "name": "Израиль"
}, {
    "mask": "+91 (####) ###-###",
    "cc"  : "IN",
    "name": "Индия"
}, {
    "mask": "+246-###-####",
    "cc"  : "IO",
    "name": "Диего-Гарсия"
}, {
    "mask": "+964 (###) ###-####",
    "cc"  : "IQ",
    "name": "Ирак"
}, {
    "mask": "+98 (###) ###-####",
    "cc"  : "IR",
    "name": "Иран"
}, {
    "mask": "+354-###-####",
    "cc"  : "IS",
    "name": "Исландия"
}, {
    "mask": "+39 (###) ####-###",
    "cc"  : "IT",
    "name": "Италия"
}, {
    "mask": "+1 (876) ###-####",
    "cc"  : "JM",
    "name": "Ямайка"
}, {
    "mask": "+962-#-####-####",
    "cc"  : "JO",
    "name": "Иордания"
}, {
    "mask": "+81-##-####-####",
    "cc"  : "JP",
    "name": "Япония"
}, {
    "mask": "+81 (###) ###-###",
    "cc"  : "JP",
    "name": "Япония"
}, {
    "mask": "+254-###-######",
    "cc"  : "KE",
    "name": "Кения"
}, {
    "mask": "+996 (###) ###-###",
    "cc"  : "KG",
    "name": "Киргизия"
}, {
    "mask": "+855-##-###-###",
    "cc"  : "KH",
    "name": "Камбоджа"
}, {
    "mask": "+686-##-###",
    "cc"  : "KI",
    "name": "Кирибати"
}, {
    "mask": "+269-##-#####",
    "cc"  : "KM",
    "name": "Коморы"
}, {
    "mask": "+1 (869) ###-####",
    "cc"  : "KN",
    "name": "Сент-Китс и Невис"
}, {
    "mask": "+850-191-###-####",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+850-##-###-###",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+850-###-####-###",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+850-###-###",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+850-####-####",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+850-####-#############",
    "cc"  : "KP",
    "name": "Корейская НДР"
}, {
    "mask": "+82-##-###-####",
    "cc"  : "KR",
    "name": "Респ. Корея"
}, {
    "mask": "+965-####-####",
    "cc"  : "KW",
    "name": "Кувейт"
}, {
    "mask": "+1 (345) ###-####",
    "cc"  : "KY",
    "name": "Каймановы острова"
}, {
    "mask": "+7 (6##) ###-##-##",
    "cc"  : "KZ",
    "name": "Казахстан"
}, {
    "mask": "+7 (7##) ###-##-##",
    "cc"  : "KZ",
    "name": "Казахстан"
}, {
    "mask": "+856 (20##) ###-###",
    "cc"  : "LA",
    "name": "Лаос"
}, {
    "mask": "+856-##-###-###",
    "cc"  : "LA",
    "name": "Лаос"
}, {
    "mask": "+961-##-###-###",
    "cc"  : "LB",
    "name": "Ливан"
}, {
    "mask": "+961-#-###-###",
    "cc"  : "LB",
    "name": "Ливан"
}, {
    "mask": "+1 (758) ###-####",
    "cc"  : "LC",
    "name": "Сент-Люсия"
}, {
    "mask": "+423 (###) ###-####",
    "cc"  : "LI",
    "name": "Лихтенштейн"
}, {
    "mask": "+94-##-###-####",
    "cc"  : "LK",
    "name": "Шри-Ланка"
}, {
    "mask": "+231-##-###-###",
    "cc"  : "LR",
    "name": "Либерия"
}, {
    "mask": "+266-#-###-####",
    "cc"  : "LS",
    "name": "Лесото"
}, {
    "mask": "+370 (###) ##-###",
    "cc"  : "LT",
    "name": "Литва"
}, {
    "mask": "+352 (###) ###-###",
    "cc"  : "LU",
    "name": "Люксембург"
}, {
    "mask": "+371-##-###-###",
    "cc"  : "LV",
    "name": "Латвия"
}, {
    "mask": "+218-##-###-###",
    "cc"  : "LY",
    "name": "Ливия"
}, {
    "mask": "+218-21-###-####",
    "cc"  : "LY",
    "name": "Ливия"
}, {
    "mask": "+212-##-####-###",
    "cc"  : "MA",
    "name": "Марокко"
}, {
    "mask": "+377 (###) ###-###",
    "cc"  : "MC",
    "name": "Монако"
}, {
    "mask": "+377-##-###-###",
    "cc"  : "MC",
    "name": "Монако"
}, {
    "mask": "+373-####-####",
    "cc"  : "MD",
    "name": "Молдова"
}, {
    "mask": "+382-##-###-###",
    "cc"  : "ME",
    "name": "Черногория"
}, {
    "mask": "+261-##-##-#####",
    "cc"  : "MG",
    "name": "Мадагаскар"
}, {
    "mask": "+692-###-####",
    "cc"  : "MH",
    "name": "Маршалловы Острова"
}, {
    "mask": "+389-##-###-###",
    "cc"  : "MK",
    "name": "Респ. Македония"
}, {
    "mask": "+223-##-##-####",
    "cc"  : "ML",
    "name": "Мали"
}, {
    "mask": "+95-##-###-###",
    "cc"  : "MM",
    "name": "Бирма (Мьянма)"
}, {
    "mask": "+95-#-###-###",
    "cc"  : "MM",
    "name": "Бирма (Мьянма)"
}, {
    "mask": "+95-###-###",
    "cc"  : "MM",
    "name": "Бирма (Мьянма)"
}, {
    "mask": "+976-##-##-####",
    "cc"  : "MN",
    "name": "Монголия"
}, {
    "mask": "+853-####-####",
    "cc"  : "MO",
    "name": "Макао"
}, {
    "mask": "+1 (670) ###-####",
    "cc"  : "MP",
    "name": "Северные Марианские острова Сайпан"
}, {
    "mask": "+596 (###) ##-##-##",
    "cc"  : "MQ",
    "name": "Мартиника"
}, {
    "mask": "+222-##-##-####",
    "cc"  : "MR",
    "name": "Мавритания"
}, {
    "mask": "+1 (664) ###-####",
    "cc"  : "MS",
    "name": "Монтсеррат"
}, {
    "mask": "+356-####-####",
    "cc"  : "MT",
    "name": "Мальта"
}, {
    "mask": "+230-###-####",
    "cc"  : "MU",
    "name": "Маврикий"
}, {
    "mask": "+960-###-####",
    "cc"  : "MV",
    "name": "Мальдивские острова"
}, {
    "mask": "+265-1-###-###",
    "cc"  : "MW",
    "name": "Малави"
}, {
    "mask": "+265-#-####-####",
    "cc"  : "MW",
    "name": "Малави"
}, {
    "mask": "+52 (###) ###-####",
    "cc"  : "MX",
    "name": "Мексика"
}, {
    "mask": "+52-##-##-####",
    "cc"  : "MX",
    "name": "Мексика"
}, {
    "mask": "+60-##-###-####",
    "cc"  : "MY",
    "name": "Малайзия"
}, {
    "mask": "+60 (###) ###-###",
    "cc"  : "MY",
    "name": "Малайзия"
}, {
    "mask": "+60-##-###-###",
    "cc"  : "MY",
    "name": "Малайзия"
}, {
    "mask": "+60-#-###-###",
    "cc"  : "MY",
    "name": "Малайзия"
}, {
    "mask": "+258-##-###-###",
    "cc"  : "MZ",
    "name": "Мозамбик"
}, {
    "mask": "+264-##-###-####",
    "cc"  : "NA",
    "name": "Намибия"
}, {
    "mask": "+687-##-####",
    "cc"  : "NC",
    "name": "Новая Каледония"
}, {
    "mask": "+227-##-##-####",
    "cc"  : "NE",
    "name": "Нигер"
}, {
    "mask": "+672-3##-###",
    "cc"  : "NF",
    "name": "Норфолк (остров)"
}, {
    "mask": "+234 (###) ###-####",
    "cc"  : "NG",
    "name": "Нигерия"
}, {
    "mask": "+234-##-###-###",
    "cc"  : "NG",
    "name": "Нигерия"
}, {
    "mask": "+234-##-###-##",
    "cc"  : "NG",
    "name": "Нигерия"
}, {
    "mask": "+234 (###) ###-####",
    "cc"  : "NG",
    "name": "Нигерия"
}, {
    "mask": "+505-####-####",
    "cc"  : "NI",
    "name": "Никарагуа"
}, {
    "mask": "+31-##-###-####",
    "cc"  : "NL",
    "name": "Нидерланды"
}, {
    "mask": "+47 (###) ##-###",
    "cc"  : "NO",
    "name": "Норвегия"
}, {
    "mask": "+977-##-###-###",
    "cc"  : "NP",
    "name": "Непал"
}, {
    "mask": "+674-###-####",
    "cc"  : "NR",
    "name": "Науру"
}, {
    "mask": "+683-####",
    "cc"  : "NU",
    "name": "Ниуэ"
}, {
    "mask": "+64 (###) ###-###",
    "cc"  : "NZ",
    "name": "Новая Зеландия"
}, {
    "mask": "+64-##-###-###",
    "cc"  : "NZ",
    "name": "Новая Зеландия"
}, {
    "mask": "+64 (###) ###-####",
    "cc"  : "NZ",
    "name": "Новая Зеландия"
}, {
    "mask": "+968-##-###-###",
    "cc"  : "OM",
    "name": "Оман"
}, {
    "mask": "+507-###-####",
    "cc"  : "PA",
    "name": "Панама"
}, {
    "mask": "+51 (###) ###-###",
    "cc"  : "PE",
    "name": "Перу"
}, {
    "mask": "+689-##-##-##",
    "cc"  : "PF",
    "name": "Французская Полинезия (Таити)"
}, {
    "mask": "+675 (###) ##-###",
    "cc"  : "PG",
    "name": "Папуа-Новая Гвинея"
}, {
    "mask": "+63 (###) ###-####",
    "cc"  : "PH",
    "name": "Филиппины"
}, {
    "mask": "+92 (###) ###-####",
    "cc"  : "PK",
    "name": "Пакистан"
}, {
    "mask": "+48 (###) ###-###",
    "cc"  : "PL",
    "name": "Польша"
}, {
    "mask": "+970-##-###-####",
    "cc"  : "PS",
    "name": "Палестина"
}, {
    "mask": "+351-##-###-####",
    "cc"  : "PT",
    "name": "Португалия"
}, {
    "mask": "+680-###-####",
    "cc"  : "PW",
    "name": "Палау"
}, {
    "mask": "+595 (###) ###-###",
    "cc"  : "PY",
    "name": "Парагвай"
}, {
    "mask": "+974-####-####",
    "cc"  : "QA",
    "name": "Катар"
}, {
    "mask": "+262-#####-####",
    "cc"  : "RE",
    "name": "Реюньон"
}, {
    "mask": "+40-##-###-####",
    "cc"  : "RO",
    "name": "Румыния"
}, {
    "mask": "+381-##-###-####",
    "cc"  : "RS",
    "name": "Сербия"
}, {
    "mask": "+7 (###) ###-##-##",
    "cc"  : "RU",
    "name": "Россия"
}, {
    "mask": "+250 (###) ###-###",
    "cc"  : "RW",
    "name": "Руанда"
}, {
    "mask": "+966-5-####-####",
    "cc"  : "SA",
    "name": "Саудовская Аравия"
}, {
    "mask": "+966-#-###-####",
    "cc"  : "SA",
    "name": "Саудовская Аравия"
}, {
    "mask": "+677-###-####",
    "cc"  : "SB",
    "name": "Соломоновы Острова"
}, {
    "mask": "+677-#####",
    "cc"  : "SB",
    "name": "Соломоновы Острова"
}, {
    "mask": "+248-#-###-###",
    "cc"  : "SC",
    "name": "Сейшелы"
}, {
    "mask": "+249-##-###-####",
    "cc"  : "SD",
    "name": "Судан"
}, {
    "mask": "+46-##-###-####",
    "cc"  : "SE",
    "name": "Швеция"
}, {
    "mask": "+65-####-####",
    "cc"  : "SG",
    "name": "Сингапур"
}, {
    "mask": "+290-####",
    "cc"  : "SH",
    "name": "Остров Святой Елены"
}, {
    "mask": "+290-####",
    "cc"  : "SH",
    "name": "Тристан-да-Кунья"
}, {
    "mask": "+386-##-###-###",
    "cc"  : "SI",
    "name": "Словения"
}, {
    "mask": "+421 (###) ###-###",
    "cc"  : "SK",
    "name": "Словакия"
}, {
    "mask": "+232-##-######",
    "cc"  : "SL",
    "name": "Сьерра-Леоне"
}, {
    "mask": "+378-####-######",
    "cc"  : "SM",
    "name": "Сан-Марино"
}, {
    "mask": "+221-##-###-####",
    "cc"  : "SN",
    "name": "Сенегал"
}, {
    "mask": "+252-##-###-###",
    "cc"  : "SO",
    "name": "Сомали"
}, {
    "mask": "+252-#-###-###",
    "cc"  : "SO",
    "name": "Сомали"
}, {
    "mask": "+252-#-###-###",
    "cc"  : "SO",
    "name": "Сомали"
}, {
    "mask": "+597-###-####",
    "cc"  : "SR",
    "name": "Суринам"
}, {
    "mask": "+597-###-###",
    "cc"  : "SR",
    "name": "Суринам"
}, {
    "mask": "+211-##-###-####",
    "cc"  : "SS",
    "name": "Южный Судан"
}, {
    "mask": "+239-##-#####",
    "cc"  : "ST",
    "name": "Сан-Томе и Принсипи"
}, {
    "mask": "+503-##-##-####",
    "cc"  : "SV",
    "name": "Сальвадор"
}, {
    "mask": "+1 (721) ###-####",
    "cc"  : "SX",
    "name": "Синт-Маартен"
}, {
    "mask": "+963-##-####-###",
    "cc"  : "SY",
    "name": "Сирийская арабская республика"
}, {
    "mask": "+268-##-##-####",
    "cc"  : "SZ",
    "name": "Свазиленд"
}, {
    "mask": "+1 (649) ###-####",
    "cc"  : "TC",
    "name": "Тёркс и Кайкос"
}, {
    "mask": "+235-##-##-##-##",
    "cc"  : "TD",
    "name": "Чад"
}, {
    "mask": "+228-##-###-###",
    "cc"  : "TG",
    "name": "Того"
}, {
    "mask": "+66-##-###-####",
    "cc"  : "TH",
    "name": "Таиланд"
}, {
    "mask": "+66-##-###-###",
    "cc"  : "TH",
    "name": "Таиланд"
}, {
    "mask": "+992-##-###-####",
    "cc"  : "TJ",
    "name": "Таджикистан"
}, {
    "mask": "+690-####",
    "cc"  : "TK",
    "name": "Токелау"
}, {
    "mask": "+670-###-####",
    "cc"  : "TL",
    "name": "Восточный Тимор"
}, {
    "mask": "+670-77#-#####",
    "cc"  : "TL",
    "name": "Восточный Тимор"
}, {
    "mask": "+670-78#-#####",
    "cc"  : "TL",
    "name": "Восточный Тимор"
}, {
    "mask": "+993-#-###-####",
    "cc"  : "TM",
    "name": "Туркменистан"
}, {
    "mask": "+216-##-###-###",
    "cc"  : "TN",
    "name": "Тунис"
}, {
    "mask": "+676-#####",
    "cc"  : "TO",
    "name": "Тонга"
}, {
    "mask": "+90 (###) ###-####",
    "cc"  : "TR",
    "name": "Турция"
}, {
    "mask": "+1 (868) ###-####",
    "cc"  : "TT",
    "name": "Тринидад и Тобаго"
}, {
    "mask": "+688-90####",
    "cc"  : "TV",
    "name": "Тувалу"
}, {
    "mask": "+688-2####",
    "cc"  : "TV",
    "name": "Тувалу"
}, {
    "mask": "+886-#-####-####",
    "cc"  : "TW",
    "name": "Тайвань"
}, {
    "mask": "+886-####-####",
    "cc"  : "TW",
    "name": "Тайвань"
}, {
    "mask": "+255-##-###-####",
    "cc"  : "TZ",
    "name": "Танзания"
}, {
    "mask": "+380 (##) ###-##-##",
    "cc"  : "UA",
    "name": "Украина"
}, {
    "mask": "+256 (###) ###-###",
    "cc"  : "UG",
    "name": "Уганда"
}, {
    "mask": "+44-##-####-####",
    "cc"  : "UK",
    "name": "Великобритания"
}, {
    "mask": "+598-#-###-##-##",
    "cc"  : "UY",
    "name": "Уругвай"
}, {
    "mask": "+998-##-###-####",
    "cc"  : "UZ",
    "name": "Узбекистан"
}, {
    "mask": "+39-6-698-#####",
    "cc"  : "VA",
    "name": "Ватикан"
}, {
    "mask": "+1 (784) ###-####",
    "cc"  : "VC",
    "name": "Сент-Винсент и Гренадины"
}, {
    "mask": "+58 (###) ###-####",
    "cc"  : "VE",
    "name": "Венесуэла"
}, {
    "mask": "+1 (284) ###-####",
    "cc"  : "VG",
    "name": "Британские Виргинские острова"
}, {
    "mask": "+1 (340) ###-####",
    "cc"  : "VI",
    "name": "Американские Виргинские острова"
}, {
    "mask": "+84-##-####-###",
    "cc"  : "VN",
    "name": "Вьетнам"
}, {
    "mask": "+84 (###) ####-###",
    "cc"  : "VN",
    "name": "Вьетнам"
}, {
    "mask": "+678-##-#####",
    "cc"  : "VU",
    "name": "Вануату"
}, {
    "mask": "+678-#####",
    "cc"  : "VU",
    "name": "Вануату"
}, {
    "mask": "+681-##-####",
    "cc"  : "WF",
    "name": "Уоллис и Футуна"
}, {
    "mask": "+685-##-####",
    "cc"  : "WS",
    "name": "Самоа"
}, {
    "mask": "+967-###-###-###",
    "cc"  : "YE",
    "name": "Йемен"
}, {
    "mask": "+967-#-###-###",
    "cc"  : "YE",
    "name": "Йемен"
}, {
    "mask": "+967-##-###-###",
    "cc"  : "YE",
    "name": "Йемен"
}, {
    "mask": "+27-##-###-####",
    "cc"  : "ZA",
    "name": "Южно-Африканская Респ."
}, {
    "mask": "+260-##-###-####",
    "cc"  : "ZM",
    "name": "Замбия"
}, {
    "mask": "+263-#-######",
    "cc"  : "ZW",
    "name": "Зимбабве"
}, {
    "mask": "+1 (###) ###-####",
    "cc"  : "US",
    "name": "США"
}, {
    "mask": "+1 (###) ###-####",
    "cc"  : "CA",
    "name": "Канада"
}].filter(function(item) {
    return in_array(item.cc, availablePhoneCodes);
});
